Охотники_и_рыболовы/src/Documents/Заявление/Заявление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявление</name>
  <basedOn>Document.РазрешениеНаОхоту</basedOn>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РазрешениеНаОхоту</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПериод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Охотники_и_рыболовы/src/InformationRegisters/ОхотничьиБилеты/ОхотничьиБилеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОхотничьиБилеты</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗарегистрированВ</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
      <types>CatalogRef.ОрганыВыдачиГосБилетов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемВыдан</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияЛишения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Причина</name>
    <type>
      <types>EnumRef.ПричиныНедействительностиБилета</types>
    </type>
  </attributes>
  <dimensions>
    <name>Охотник</name>
    <type>
      <types>CatalogRef.Охотники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБилета</name>
    <type>
      <types>EnumRef.ВидыОхотничьихБилетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Действует</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лишен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исключен</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/InformationRegisters/Ограничение/Ограничение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Ограничение</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дичь</name>
    <type>
      <types>CatalogRef.Дичь</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/InformationRegisters/ЦеныПоВидамДичи/ЦеныПоВидамДичи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПоВидамДичи</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаСвоимРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаСвоимСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаЧужимРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаЧужимСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоГосБилетРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоГосБилетСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаШтатнымСотрудникам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаВетеранамВойны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаИнвалидамПервойГруппы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаПослеВозрастногоПорога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоСезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДействиеОсобыхЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КлючСвязи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/InformationRegisters/ОграниченияДичиНаДобычу/ОграниченияДичиНаДобычу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОграниченияДичиНаДобычу</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоличествоВДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоЗаСезон</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ограничено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючСвязи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дичь</name>
    <type>
      <types>CatalogRef.ГруппыДичи</types>
      <types>CatalogRef.Дичь</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/Enums/ВидыОхотничьихБилетов/ВидыОхотничьихБилетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОхотничьихБилетов</name>
  <enumValues>
    <name>ГосБилет</name>
    <comment>Охотничий билет Российской Федерации</comment>
  </enumValues>
  <enumValues>
    <name>ЧленскийБилет</name>
    <comment>Членский охотничье-рыболовный билет</comment>
  </enumValues>
</mdclass:Enum>

Охотники_и_рыболовы/src/Documents/Заявление/ManagerModule.bsl
Процедура ПолучитьТабДок(ТабДок, ТабДокДляПечати,ПараметрыПечати) Экспорт
	
	Макет 			= Документы.Заявление.ПолучитьМакет(ПараметрыПечати.ИмяМакета);
	МакетДляПечати 	= Документы.Заявление.ПолучитьМакет(ПараметрыПечати.ИмяМакета + "ДляПечати");
	
	Ссылка 			= ПараметрыПечати.Документ;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заявление.МестоОхоты КАК МестоОхотыСсылка,
	|   Заявление.МестоОхоты.НаименованиеДляПечати КАК МестоОхоты,
	|	Заявление.Дата КАК Дата,
	|	Заявление.Ответственный.Представление КАК Исполнитель,
	|	Заявление.Охотхозяйство.НаименованиеДляЗаявления КАК Охотхозяйство,
	|	ЕСТЬNULL(Заявление.Охотник, """") КАК Охотник,
	|	ЕСТЬNULL(Заявление.Охотник.Фамилия, """") КАК Фамилия,
	|	ЕСТЬNULL(Заявление.Охотник.Имя, """") + "" "" + ЕСТЬNULL(Заявление.Охотник.Отчество, """") КАК ИмяОтчество,
	|	ЕСТЬNULL(ОхотничьиБилеты.Серия, """") КАК СерияБилета,
	|	ЕСТЬNULL(ОхотничьиБилеты.Номер, """") КАК НомерБилета,
	|	ЕСТЬNULL(ОхотничьиБилеты.ДатаВыдачи, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВыдачи,
	|	Заявление.Охотхозяйство.СубъектРФ.Наименование КАК СубъектРФ,
	|	Заявление.СезонОхоты КАК СезонОхоты,
	|	Заявление.ВидДичи КАК ВидДичи,
	|	ЕСТЬNULL(Заявление.ДатаНачала, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаНачала,
	|	ЕСТЬNULL(Заявление.ДатаОкончания, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОкончания,
	|	Заявление.Охотхозяйство.ФИОРуководителя КАК Руководитель,
	|	Заявление.Охотник.Фамилия + "" "" + Заявление.Охотник.Имя + "" "" + Заявление.Охотник.Отчество КАК ОхотникФИО,
	|	Заявление.Охотник.Фамилия + "" "" + ПОДСТРОКА(Заявление.Охотник.Имя, 1, 1) + ""."" + ПОДСТРОКА(Заявление.Охотник.Отчество, 1, 1) + ""."" КАК ОхотникИнициалы
	|ПОМЕСТИТЬ ВТ1
	|ИЗ
	|	Документ.Заявление КАК Заявление
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОхотничьиБилеты КАК ОхотничьиБилеты
	|		ПО Заявление.Охотник = ОхотничьиБилеты.Охотник
	|			И (ОхотничьиБилеты.ВидБилета = ЗНАЧЕНИЕ(Перечисление.ВидыОхотничьихБилетов.ГосБилет))
	|			И (ОхотничьиБилеты.Действует)
	|ГДЕ
	|	Заявление.Ссылка В(&Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ограничение.Дичь КАК Дичь
	|ПОМЕСТИТЬ ВТОграничение
	|ИЗ
	|	РегистрСведений.Ограничение КАК Ограничение
	|ГДЕ
	|	(Ограничение.СезонОхоты, Ограничение.Охотхозяйство) В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				Т.СезонОхоты,
	|				Т.МестоОхотыСсылка
	|			ИЗ
	|				ВТ1 КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ1.МестоОхоты,
	|	ВТ1.Дата,
	|	ВТ1.Охотхозяйство,
	|	ВТ1.ИмяОтчество,
	|	ВТ1.СерияБилета,
	|	ВТ1.НомерБилета,
	|	ВТ1.ДатаВыдачи,
	|	ВТ1.ОхотникФИО,
	|	ВТ1.Руководитель,
	|	ВТ1.СезонОхоты,
	|	ВТ1.ВидДичи
	|ИЗ
	|	ВТ1 КАК ВТ1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ1.ДатаНачала,
	|	ВТ1.ДатаОкончания,
	|	ПерваяСтрочкаЦены.КлючСвязи,
	|	ПерваяСтрочкаЦены.ВидДичи
	|ПОМЕСТИТЬ ВТ2
	|ИЗ
	|	РегистрСведений.ЦеныПоВидамДичи.СрезПоследних(
	|			&Дата,
	|			СезонОхоты = &СезонОхоты
	|				И ВидДичи = &ВидДичи) КАК ПерваяСтрочкаЦены
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ1 КАК ВТ1
	|		ПО (ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПерваяСтрочкаЦены.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ2.ДатаНачала,
	|	ВТ2.ДатаОкончания,
	|	УстановкаОграниченийИЦенСостав.Дичь КАК ВидРесурсов,
	|	УстановкаОграниченийИЦенСостав.Ограничено КАК Ограничено,
	|	УстановкаОграниченийИЦенСостав.КоличествоВДень КАК КоличествоВДень,
	|	УстановкаОграниченийИЦенСостав.КоличествоЗаСезон КАК КоличествоЗаСезон,
	|	УстановкаОграниченийИЦенСостав.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ПерваяСтрочкаСостав
	|ИЗ
	|	ВТ2 КАК ВТ2
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УстановкаОграниченийИЦен.Состав КАК УстановкаОграниченийИЦенСостав
	|		ПО ВТ2.КлючСвязи = УстановкаОграниченийИЦенСостав.КлючСвязи,
	|	ВТ1 КАК ВТ1
	|ГДЕ
	|	НЕ УстановкаОграниченийИЦенСостав.Дичь В
	|				(ВЫБРАТЬ
	|					Т.Дичь
	|				ИЗ
	|					ВТОграничение КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ1.ДатаНачала КАК ДатаНачала,
	|	ВТ1.ДатаОкончания КАК ДатаОкончания,
	|	ОграниченияДичи.Дичь КАК ВидРесурсов,
	|	ОграниченияДичи.Ограничено,
	|	ОграниченияДичи.КоличествоВДень,
	|	ОграниченияДичи.КоличествоЗаСезон,
	|	ОграниченияДичи.НомерСтроки,
	|	ОграниченияДичи.КлючСвязи
	|ПОМЕСТИТЬ Исходная
	|ИЗ
	|	ВТ1 КАК ВТ1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныПоВидамДичи.СрезПоследних(
	|				&Дата,
	|				СезонОхоты = &СезонОхоты
	|					И ВидДичи = &ВидДичи) КАК ЦеныПоВидамДичи
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОграниченияДичиНаДобычу.СрезПоследних(
	|					&Дата,
	|					СезонОхоты = &СезонОхоты
	|						И ВидДичи = &ВидДичи) КАК ОграниченияДичи
	|			ПО ЦеныПоВидамДичи.КлючСвязи = ОграниченияДичи.КлючСвязи
	|		ПО (ВЫБОР
	|				КОГДА &ТолькоСезонная
	|					ТОГДА ВТ1.ДатаНачала = ЦеныПоВидамДичи.ДатаНачала
	|							И ВТ1.ДатаОкончания = ЦеныПоВидамДичи.ДатаОкончания
	|				ИНАЧЕ ВТ1.ДатаНачала >= ЦеныПоВидамДичи.ДатаНачала
	|						И ВТ1.ДатаОкончания <= ЦеныПоВидамДичи.ДатаОкончания
	|			КОНЕЦ)
	|ГДЕ
	|	НЕ ОграниченияДичи.Дичь В
	|				(ВЫБРАТЬ
	|					Т.Дичь
	|				ИЗ
	|					ВТОграничение КАК Т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(исходная.ДатаНачала, ПерваяСтрочка.ДатаНачала) КАК ДатаНачала,
	|	ЕСТЬNULL(исходная.ДатаОкончания, ПерваяСтрочка.ДатаОкончания) КАК ДатаОкончания,
	|	ЕСТЬNULL(исходная.ВидРесурсов, ПерваяСтрочка.ВидРесурсов) КАК ВидРесурсов,
	|	ЕСТЬNULL(исходная.Ограничено, ПерваяСтрочка.Ограничено) КАК Ограничено,
	|	ЕСТЬNULL(исходная.КоличествоВДень, ПерваяСтрочка.КоличествоВДень) КАК КоличествоВДень,
	|	ЕСТЬNULL(исходная.КоличествоЗаСезон, ПерваяСтрочка.КоличествоЗаСезон) КАК КоличествоЗаСезон,
	|	ЕСТЬNULL(исходная.НомерСтроки, ПерваяСтрочка.НомерСтроки) КАК НомерСтроки
	|ИЗ
	|	Исходная КАК исходная
	|		ПОЛНОЕ СОЕДИНЕНИЕ ПерваяСтрочкаСостав КАК ПерваяСтрочка
	|		ПО исходная.ВидРесурсов = ПерваяСтрочка.ВидРесурсов
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";

	
	мПериоды = ОхотаСервер.ПолучитьПериодыОхоты(Ссылка); 
	Периоды = мПериоды.Выгрузить();
	ТолькоСезонная = Истина;
	Для каждого стр из Периоды Цикл
		ТолькоСезонная = ТолькоСезонная И стр.ТолькоСезонная;
	КонецЦикла;		

	
	Запрос.Параметры.Вставить("ТолькоСезонная",ТолькоСезонная);
	Запрос.Параметры.Вставить("СезонОхоты",Ссылка.СезонОхоты);
	Запрос.Параметры.Вставить("ВидДичи",Ссылка.ВидДичи);
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Запрос.Параметры.Вставить("Дата",Ссылка.Дата);	
	
	Результат = Запрос.ВыполнитьПакет();
	
	Выборка = Результат[2].Выбрать();
	
	ОбластьЗаявление = Макет.ПолучитьОбласть("Заявление");
	ТабДок.Очистить();
	
	ОбластьЗаявлениеДляПечати = МакетДляПечати.ПолучитьОбласть("Заявление");
	ТабДокДляПечати.Очистить();
	
		
	Пока Выборка.Следующий() Цикл
		СтруктураУточнений = Новый Структура;
		
		ОбластьЗаявление.Параметры.Заполнить(Выборка);
		ОбластьЗаявлениеДляПечати.Параметры.Заполнить(Выборка);
		
		МестоОхоты = СокрЛП(Выборка.МестоОхоты);
		МестоОхотыСтроки = СтрЗаменить(МестоОхоты," ",Символы.ПС);
		ПереноситьПоГласным = Ложь;
		
		СтруктураУточнений = Новый Структура;
		
				
		ДлинаСтроки = СтрДлина(МестоОхоты);
		 ОграничениеПервойСтроки = 30;
		ОграничениеСледующихСтрок = 40;
		Если  ДлинаСтроки > ОграничениеПервойСтроки Тогда
			СтрокаПервая = "";
			инд = 1;
			
			Пока Истина Цикл
				СледующаяСтрока = СокрЛП(СтрПолучитьСтроку(МестоОхотыСтроки,инд));
				Если НЕ ПустаяСтрока(СледующаяСтрока) Тогда
					Если СтрДлина(СтрокаПервая + ?(инд = 1,""," ") + СледующаяСтрока) > ОграничениеПервойСтроки Тогда
						Прервать;
					Иначе
						СтрокаПервая = СтрокаПервая + ?(инд = 1,""," ") + СледующаяСтрока;
					КонецЕсли;
				Иначе	
					Прервать;	
				КонецЕсли;
				инд = инд + 1;	
			КонецЦикла;
			
			Если ПереноситьПоГласным Тогда
				Гласные = Новый Массив;
				Гласные.Добавить("а");
				Гласные.Добавить("о");
				Гласные.Добавить("у");
				Гласные.Добавить("и");
				Гласные.Добавить("е");
				Гласные.Добавить("я");
					
				Для позпроб = 20 по ДлинаСтроки Цикл
					Если Гласные.Найти(Сред(МестоОхоты,позпроб,1)) <> Неопределено Тогда
						Прервать;
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;
			
			СтруктураУточнений.Вставить("МестоОхоты",СтрокаПервая);
			
			ВтораяСтрока = "";
			индвтстр = 1;
			Пока Истина Цикл
				СледующаяСтрока = СокрЛП(СтрПолучитьСтроку(МестоОхотыСтроки,инд));
				Если НЕ ПустаяСтрока(СледующаяСтрока) Тогда
					Если СтрДлина(ВтораяСтрока + ?(индвтстр = 1,""," ") + СледующаяСтрока) > ОграничениеСледующихСтрок Тогда
						Прервать;
					Иначе
						ВтораяСтрока = ВтораяСтрока + ?(индвтстр = 1,""," ") + СледующаяСтрока;
					КонецЕсли;
				Иначе
					Прервать;
				КонецЕсли;
				индвтстр = индвтстр + 1;
				инд = инд + 1;	
			КонецЦикла;

			Если НЕ ПустаяСтрока(ВтораяСтрока) Тогда
				СтруктураУточнений.Вставить("МестоОхотыСтр1",ВтораяСтрока);
			
			
				ТретьяСтрока = "";
				индтрстр = 1;
				Пока Истина Цикл
					СледующаяСтрока = СокрЛП(СтрПолучитьСтроку(МестоОхотыСтроки,инд));
					Если НЕ ПустаяСтрока(СледующаяСтрока) Тогда
						Если СтрДлина(ТретьяСтрока + ?(индтрстр = 1,""," ") + СледующаяСтрока) > ОграничениеСледующихСтрок Тогда
							Прервать;
						Иначе
							ТретьяСтрока = ТретьяСтрока + ?(индтрстр = 1,""," ") + СледующаяСтрока;
						КонецЕсли;
					Иначе
						Прервать;
					КонецЕсли;
					индтрстр = индтрстр + 1;
					инд = инд + 1;	
				КонецЦикла;
				Если НЕ ПустаяСтрока(ТретьяСтрока) Тогда
					СтруктураУточнений.Вставить("МестоОхотыСтр2",ТретьяСтрока);
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
		
		ПустаяДата = '00010101';
		
							
	КонецЦикла;
	
	Выборка = Результат[6].Выбрать();
		
		а = 1;
		СтруктураПараметров = Новый Структура;
		
		Пока Выборка.Следующий() Цикл
			
			СтруктураПараметров.Вставить("Номер" + Строка(а),а);
			
			СтруктураПараметров.Вставить("ВидРесурсов" + Строка(а),Выборка.ВидРесурсов);
			
			Если НЕ Выборка.ДатаНачала = ПустаяДата Тогда
			
				ДатаНачала 		=  Формат(Выборка.ДатаНачала, 		"ДФ = 'дд.ММ гггг'");
				ДатаОкончания 	=  Формат(Выборка.ДатаОкончания, 	"ДФ = 'дд.ММ гггг'");
				
				СтруктураПараметров.Вставить("с" + Строка(а),ДатаНачала);
				СтруктураПараметров.Вставить("по" + Строка(а),ДатаОкончания);
			
			КонецЕсли;
			
			Если Выборка.Ограничено Тогда
				Если Выборка.КоличествоВДень > 0 Тогда
					колонка = "дд";
					Количество = Выборка.КоличествоВДень;
				Иначе
					колонка = "дд";
					Количество = Выборка.КоличествоЗаСезон;
				КонецЕсли;
				
				СтруктураПараметров.Вставить(колонка + Строка(а),Строка(Количество) + " шт");
			Иначе
				
				СтруктураПараметров.Вставить("дд" + Строка(а),"НЕОГР");
			КонецЕсли;			
			а = а + 1;
		КонецЦикла;

		ОбластьЗаявление.Параметры.Заполнить(СтруктураПараметров);
		ОбластьЗаявлениеДляПечати.Параметры.Заполнить(СтруктураПараметров);

	
	
	
	ТабДок.Вывести(ОбластьЗаявление);
	
	ТабДок.ПолеСверху 		=  0;
	ТабДок.ПолеСнизу 		= 0;
	ТабДок.ПолеСлева 		= 0;
	ТабДок.ПолеСправа 		= 0;
	
	ТабДокДляПечати.Вывести(ОбластьЗаявлениеДляПечати);
	ТабДокДляПечати.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	ТабДокДляПечати.ПолеСверху 	= 0;
	ТабДокДляПечати.ПолеСнизу 	= 0;
	ТабДокДляПечати.ПолеСлева 	= 0;
	ТабДокДляПечати.ПолеСправа 	= 0;

	
КонецПроцедуры
